000_РОЗНИЦА_ЦЕНТР/src/Documents/ПриказНаПроведениеИнвентаризацииТоваров/ПриказНаПроведениеИнвентаризацииТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриказНаПроведениеИнвентаризацииТоваров</name>
  <registerRecords>InformationRegister.ОграниченияДвиженийПоИнвентаризации</registerRecords>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилаОтбораТоваровИнвентаризации</name>
    <type>
      <types>CatalogRef.ПравилаОтбораТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПриказовНаПроведениеИнвентаризацийТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредседательКомиссии</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧленКомиссии1</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧленКомиссии2</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧленКомиссии3</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьПредседателяКомиссии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьЧленаКомиссии1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьЧленаКомиссии2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьЧленаКомиссии3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

000_РОЗНИЦА_ЦЕНТР/src/Enums/СтатусыПриказовНаПроведениеИнвентаризацийТоваров/СтатусыПриказовНаПроведениеИнвентаризацийТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПриказовНаПроведениеИнвентаризацийТоваров</name>
  <enumValues>
    <name>Отложен</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Documents/ПересчетТоваров/ПересчетТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПересчетТоваров</name>
  <basedOn>Document.ПриказНаПроведениеИнвентаризацииТоваров</basedOn>
  <registerRecords>AccumulationRegister.ТоварыПересчитанные</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКОформлениюИзлишковНедостач</registerRecords>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПриказНаПроведениеИнвентаризацииТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборПересчетаТоваров</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПересчетовТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчетныеДанныеЗаполнены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>Номенклатура</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковокФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВедомостьИнвентаризационная</name>
    <attributes>
      <name>ВедомостьИнвентаризационная</name>
      <type>
        <types>DocumentRef.ВедомостьИнвентаризационная</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/ПравилаОтбораТоваров/ПравилаОтбораТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПравилаОтбораТоваров</name>
  <predefined>
    <items>
      <name>ИнвентаризацияЗапрещенныхКПродаже</name>
      <description>Инвентаризация запрещенных к продаже</description>
    </items>
    <items>
      <name>ПолнаяИнвентаризация</name>
      <description>Полная инвентаризация</description>
    </items>
  </predefined>
  <attributes>
    <name>СхемаКомпоновкиДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Documents/ПриказНаПроведениеИнвентаризацииТоваров/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Возвращает строковое описание правил отбора товаров, параметров и отбора СКД
//
// Параметры: 
//  ДокументСсылка - Документ.ПриказНаПроведениеИнвентаризацииТоваров
//
// Возвращаемое значение:
//  Строка
//
Функция ОписаниеПравилОтбораТоваров(ДокументСсылка) Экспорт
	
	ОписаниеПравил = "";
	
	ПравилаОтбораТоваровИнвентаризации = ДокументСсылка.ПравилаОтбораТоваровИнвентаризации;
	
	Если НЕ ЗначениеЗаполнено(ПравилаОтбораТоваровИнвентаризации) Тогда
		Возврат "<Произвольный список товаров>";
	ИначеЕсли ПравилаОтбораТоваровИнвентаризации = Справочники.ПравилаОтбораТоваров.ПолнаяИнвентаризация Тогда
		СхемаИНастройки = Справочники.ПравилаОтбораТоваров.ОписаниеИСхемаКомпоновкиДанныхПоИмениМакета(ПравилаОтбораТоваровИнвентаризации, "ПолнаяИнвентаризация");
	ИначеЕсли ПравилаОтбораТоваровИнвентаризации = Справочники.ПравилаОтбораТоваров.ИнвентаризацияЗапрещенныхКПродаже Тогда
		СхемаИНастройки = Справочники.ПравилаОтбораТоваров.ОписаниеИСхемаКомпоновкиДанныхПоИмениМакета(ПравилаОтбораТоваровИнвентаризации, "ИнвентаризацияЗапрещенныхКПродаже");
	Иначе
		СхемаИНастройки = Справочники.ПравилаОтбораТоваров.ОписаниеИСхемаКомпоновкиДанныхПоИмениМакета(ПравилаОтбораТоваровИнвентаризации, ПравилаОтбораТоваровИнвентаризации.СхемаКомпоновкиДанных);
	КонецЕсли;
	
	СхемаКомпоновкиДанных = СхемаИНастройки.СхемаКомпоновкиДанных;
	
	ОписаниеСхемыКомпоновки = СхемаИНастройки.Описание;
	
	НастройкиКомпоновкиДанных = ДокументСсылка.НастройкиКомпоновкиДанных.Получить();
	
	Если НЕ ЗначениеЗаполнено(НастройкиКомпоновкиДанных) Тогда
		Если Не ЗначениеЗаполнено(СхемаИНастройки.НастройкиКомпоновкиДанных) Тогда
			КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
			УстановитьПривилегированныйРежим(Истина);
			КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
			УстановитьПривилегированныйРежим(Ложь);
			КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
			
			НастройкиКомпоновкиДанных = КомпоновщикНастроек.ПолучитьНастройки();
		Иначе
			НастройкиКомпоновкиДанных = СхемаИНастройки.НастройкиКомпоновкиДанных;
		КонецЕсли;
	КонецЕсли;
	
	ОписаниеПравил = ПравилаОтбораТоваровИнвентаризации.Наименование;
	ОписаниеПравил = ОписаниеПравил + ?(ЗначениеЗаполнено(ПравилаОтбораТоваровИнвентаризации.СхемаКомпоновкиДанных), " (" + ОписаниеСхемыКомпоновки + ")", "");
	ОписаниеПараметровНастройки = ОбщегоНазначенияРТСервер.ОписаниеПараметровНастройки(СхемаКомпоновкиДанных, НастройкиКомпоновкиДанных);
	ОписаниеПравил = ОписаниеПравил + ?(ЗначениеЗаполнено(ОписаниеПараметровНастройки)," " + ОписаниеПараметровНастройки,"");
	
	Возврат ОписаниеПравил;
	
КонецФункции // ОписаниеПравилОтбораТоваров()


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// Проведение

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаПриказа.Дата КАК Период,
	|	ТаблицаПриказа.Магазин КАК Магазин,
	|	ТаблицаПриказа.Склад КАК Склад,
	|	ТаблицаПриказа.Ссылка КАК ДокументОграничения,
	|	КОНЕЦПЕРИОДА(ТаблицаПриказа.ДатаОкончания, ДЕНЬ) КАК ГраницаЗапрета
	|ИЗ
	|	Документ.ПриказНаПроведениеИнвентаризацииТоваров КАК ТаблицаПриказа
	|ГДЕ
	|	ТаблицаПриказа.Ссылка = &Ссылка
	|	И НЕ ТаблицаПриказа.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПриказовНаПроведениеИнвентаризацийТоваров.Отложен)"
	);
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);

	Результат = Запрос.ВыполнитьПакет();

	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОграниченияДвиженийПоИнвентаризации", Результат[0].Выгрузить());

КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// Печать

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "М21") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"М21",
			"Инветаризационная опись",
			СформироватьПечатнуюФормуМ21(МассивОбъектов, ОбъектыПечати, ПараметрыПечати["Пустографка"])
		);
		
	КонецЕсли;

КонецПроцедуры

Функция СформироватьПечатнуюФормуМ21(МассивОбъектов, ОбъектыПечати, Пустографка = Ложь)
	
	ТабДок = Новый ТабличныйДокумент;
	
	КолонкаКодов = ФормированиеПечатныхФормСервер.ИмяДополнительнойКолонки();
	Если Не ЗначениеЗаполнено(КолонкаКодов) Тогда
		КолонкаКодов = "Код";
	КонецЕсли;
	
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Документ.Ссылка                                       КАК Ссылка,
		|	Документ.Номер                                        КАК Номер,
		|	Документ.Дата                                         КАК Дата,
		|	Документ.Дата                                         КАК ДатаДокумента,
		|	Документ.Дата                                         КАК ОснованиеДата,
		|	Документ.Организация                                  КАК Организация,
		|	Документ.Организация.Префикс                          КАК Префикс,
		|	ПРЕДСТАВЛЕНИЕ(Документ.Склад)                         КАК ПредставлениеСклада,
		|	ПРЕДСТАВЛЕНИЕ(Документ.Организация)                   КАК ПредставлениеОрганизации,
		|	Документ.ПредседательКомиссии 						  КАК ПредседательКомиссии,
		|	Документ.ЧленКомиссии1 								  КАК ЧленКомиссии1,
		|	Документ.ЧленКомиссии2 								  КАК ЧленКомиссии2,
		|	Документ.ЧленКомиссии3 								  КАК ЧленКомиссии3,
		|	Документ.ДолжностьПредседателяКомиссии 				  КАК ДолжностьПредседателяКомиссии,
		|	Документ.ДолжностьЧленаКомиссии1 					  КАК ДолжностьЧленаКомиссии1,
		|	Документ.ДолжностьЧленаКомиссии2 					  КАК ДолжностьЧленаКомиссии2,
		|	Документ.ДолжностьЧленаКомиссии3 					  КАК ДолжностьЧленаКомиссии3
		|ИЗ
		|	Документ.ПриказНаПроведениеИнвентаризацииТоваров КАК Документ
		|
		|ГДЕ
		|	Документ.Ссылка В (&МассивДокументов)
		|	И Документ.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка
		|;
		|
		|
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Ссылка                                                     КАК Ссылка,
		|	ВложенныйЗапрос.Номенклатура                                               КАК Номенклатура,
		|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Номенклатура)                                КАК НоменклатураПредставление,
		|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Характеристика)                              КАК ХарактеристикаПредставление,
		|	ВложенныйЗапрос.Номенклатура.НаименованиеПолное                            КАК ТоварНаименование,
		|	ВложенныйЗапрос.Номенклатура." + КолонкаКодов + "                          КАК ТоварКод,
		|	ВложенныйЗапрос.ЕдиницаИзмерения.Представление                             КАК ЕдиницаИзмеренияНаименование,
		|	ВложенныйЗапрос.ЕдиницаИзмерения.Код                                       КАК ЕдиницаИзмеренияКод,
		|	ВЫБОР
		|			КОГДА &БезФактическихДанных ТОГДА 0
		|			ИНАЧЕ ВложенныйЗапрос.Количество
		|	КОНЕЦ                                                                      КАК КоличествоФактическое,
		|	ВЫБОР
		|			КОГДА &БезФактическихДанных ТОГДА 0
		|			ИНАЧЕ ВложенныйЗапрос.Сумма
		|	КОНЕЦ                                                                      КАК Сумма,
		|	ВложенныйЗапрос.КоличествоУчет                                             КАК КоличествоУчет,
		|	ВложенныйЗапрос.Характеристика                                             КАК Характеристика,
		|	ВложенныйЗапрос.Цена                                                       КАК Цена,
		|	ВложенныйЗапрос.СуммаУчет                                                  КАК СуммаУчет,
		|	ВложенныйЗапрос.НомерСтроки                                                КАК НомерСтроки
		|ИЗ (
		|	ВЫБРАТЬ
		|		Документ.Ссылка.ДокументОснование                                      КАК Ссылка,
		|		Документ.Номенклатура                                                  КАК Номенклатура,
		|		ВЫБОР КОГДА Документ.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка) ТОГДА
		|			Документ.Номенклатура.ЕдиницаИзмерения
		|		ИНАЧЕ
		|			Документ.Упаковка.ЕдиницаИзмерения
		|		КОНЕЦ                                                                  КАК ЕдиницаИзмерения,
		|		Документ.Характеристика                                                КАК Характеристика,
		|		ВЫБОР
		|			КОГДА
		|				Документ.КоличествоУпаковок = 0
		|			ТОГДА
		|				Документ.Цена
		|			ИНАЧЕ
		|				Документ.Сумма / Документ.КоличествоУпаковок
		|		КОНЕЦ                                                                  КАК Цена,
		|		Документ.КоличествоФакт                                                КАК Количество,
		|		Документ.Количество                                                    КАК КоличествоУчет,
		|		Документ.СуммаФакт                                                     КАК Сумма,
		|		Документ.Сумма                                                         КАК СуммаУчет,
		|		Документ.НомерСтроки                                                   КАК НомерСтроки
		|	ИЗ
		|		Документ.ПересчетТоваров.Товары КАК Документ
		|	ГДЕ
		|		Документ.Ссылка.ДокументОснование В (&МассивДокументов)
		|		И Документ.Ссылка.Проведен
		|		И Документ.Ссылка.ДокументОснование.Проведен
		|		И Документ.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
		|
		|	) КАК ВложенныйЗапрос
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка,
		|	НомерСтроки
		|
		|ИТОГИ ПО
		|	Ссылка
		|");
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивОбъектов);
	Запрос.УстановитьПараметр("БезФактическихДанных", Пустографка);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПересчетТоваров_М21";
	
	// Зададим параметры макета
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	ДанныеПечати      = МассивРезультатов[0].Выбрать();
	ВыборкаПоДокументам = МассивРезультатов[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Макет = УправлениеПечатью.ПолучитьМакет("Документ.ПриказНаПроведениеИнвентаризацииТоваров.ПФ_MXL_М21");
	
	ПервыйДокумент = Истина;
	
	Пока ДанныеПечати.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Выводим общие реквизиты шапки
		ОбластьШапки        = Макет.ПолучитьОбласть("Шапка");     
		ОбластьШапкиТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");     
		ОбластьСтроки       = Макет.ПолучитьОбласть("Строка");
		ОбластьПодвал       = Макет.ПолучитьОбласть("Подвал");
		
		СведенияОбОрганизации    = ФормированиеПечатныхФормСервер.СведенияОЮрФизЛице(ДанныеПечати.Организация,      ДанныеПечати.ДатаДокумента);
		
		ОбластьШапки.Параметры.Заполнить(ДанныеПечати);
		
		ОбластьШапки.Параметры.ПредставлениеОрганизации = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование,");
		ОбластьШапки.Параметры.КодПоЕДРПОУ    = СведенияОбОрганизации.КодПоЕДРПОУ;
		ОбластьШапки.Параметры.НомерДокумента = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(ДанныеПечати.Номер, Ложь, Истина);
		ОбластьШапки.Параметры.ОснованиеНомер = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(ДанныеПечати.Номер, Ложь, Истина);
	
		ТабличныйДокумент.Вывести(ОбластьШапки);
		
		ТабличныйДокумент.Вывести(ОбластьШапкиТаблицы);
		
		НомерСтроки = 0;
		
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
		ВыборкаПоДокументам.НайтиСледующий(СтруктураПоиска);
		
		СтрокаТовары = ВыборкаПоДокументам.Выбрать();
		
		Пока СтрокаТовары.Следующий() Цикл
			
			НомерСтроки = НомерСтроки + 1;
			
			ОбластьСтроки.Параметры.Заполнить(СтрокаТовары);
			
			ОбластьСтроки.Параметры.НомерСтроки = НомерСтроки;
			
			ТабличныйДокумент.Вывести(ОбластьСтроки);
			
		КонецЦикла;
		
		ОбластьПодвал.Параметры.Заполнить(ДанныеПечати);
		ОбластьПодвал.Параметры.КоличествоПорядковыхНомеровПрописью  = ЧислоПрописью(НомерСтроки, "Л=uk; НП=Ложь",",,,,,,,,0");
		
		ОбластьПодвал.Параметры.НачальныйНомерПоПорядку = 1;
		ОбластьПодвал.Параметры.КонечныйНомерПоПорядку	= НомерСтроки;
		
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
		
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецЕсли
